---
title: RebarShapeConstraintProjectedSegmentLength
classe: Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength
namespace: Autodesk.Revit.DB.Structure
eredita: Autodesk.Revit.DB.Structure.RebarShapeConstraint
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# RebarShapeConstraintProjectedSegmentLength

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `UV Direction { get; }` | `rebarShapeConstraintProjectedSegmentLength.Direction` | UV |
| `Int32 TripleProductSign { get; }` | `rebarShapeConstraintProjectedSegmentLength.TripleProductSign` | Int32 |
| `RebarShapeSegmentEndReferenceType GetSegmentEndReferenceType(Int32)` | `rebarShapeConstraintProjectedSegmentLength.GetSegmentEndReferenceType(index)` | RebarShapeSegmentEndReferenceType |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```